{
    "version": "https://jsonfeed.org/version/1",
    "title": "bloggy skies",
    "description": "",
    "home_page_url": "https://TheCloutySkies.github.io/bloggyskies",
    "feed_url": "https://TheCloutySkies.github.io/bloggyskies/feed.json",
    "user_comment": "",
    "author": {
        "name": "Lonnie Johnston"
    },
    "items": [
        {
            "id": "https://TheCloutySkies.github.io/bloggyskies/how-i-prepped-for-a-130-day-long-bike-ride.html",
            "url": "https://TheCloutySkies.github.io/bloggyskies/how-i-prepped-for-a-130-day-long-bike-ride.html",
            "title": "How I prepped for a 130 day long bike ride",
            "summary": "When I decided to commit to this project I had absolutely no idea where to even start when it came to buying long term cycling gear. Hours upon hours of reading and watching tutorials finally brought me to a bike. The Poseidon Redwood. It was&hellip;",
            "content_html": "<p>When I decided to commit to this project I had absolutely no idea where to even start when it came to buying long term cycling gear. Hours upon hours of reading and watching tutorials finally brought me to a bike. The Poseidon Redwood. It was a fairly new bike that came up on the market at the time. It was light, durable, had a sturdy and prepped frame for lots of mounting options, and most importantly it was budget friendly. I was able to get it on sale for $749. I really lucked out because most bikes in the bike touring spaces get real pricey, real fast. Now a fair warning, if you order this bike online like I did, you’ll have to assemble the bike yourself. I believe I had to attach the handlebars, front wheel, seat post and seat, pedals, and the chain. By the time you finish, you’ll already know your bike pretty well.</p>\n<p> </p>\n<p>Now what about my sustainment? How am I supposed to carry 75 pounds of gear with me? Bags. Lots of bags. In a typical bike touring setup there are bags mounted all over a bike. The biggest bags, called panniers, were mounted on the left and right sides of my rear rack. The word pannier actually comes from an old English word for bread basket. After a bunch of online deliberations, I eventually chose the Ortlieb Back Roller Classics. Pretty much the Lebron James of bike panniers. Actually a fun fact; I named my bike, <em>Bichael Jordan.</em> If Mike is short for Michael; then Bike must be short for Bichael. But that’s aside from the point here. I also decided to buy my handlebar bag from Ortlieb, mostly because I was going to keep my camera in it and I wanted to make absolutely sure it would not get wet. And let me tell you that both of my Ortlieb products did a mind blowing job of keeping my stuff dry. Those bags have been through 30 degree nights and 105 degree days, torrential downpours and weeks of sun, crashes, drops, hundreds of miles worth of dust and dirt, and they held up magnificently. For the rest of my gear I would say that they were, very water resistant, but when you are in the great plains with nowhere to hide from a whole days onslaught of rain. You start to see where you gears’ weak points are. Like with the Ibera Trunk Bag I had a period of time in Rapid City, South Dakota where it, no joke, rained for nearly 3 days non stop. I made the mistake of leaving it out on a picnic table, naively assuming it was waterproof from previous experiences with shorter periods of precipitation. Long story short, I found out what a fish tank would look like if they had zippers. So if you gleam any lessons from this, if you can afford to invest in vetted, more expensive gear. <strong>Do it.</strong> All together if you were to buy the same stuff that I did, and brand new, the price would come out to be close to $5000. That being said though, about three quarters of this stuff I bought used online and I probably paid about half of that hypothetical $5000.</p>\n<h2>Bike Specific Equipment</h2>\n<ul>\n<li><strong>Bike:</strong> Poseidon Redwood Dropbar - Large (I got it on sale for $749)</li>\n<li><strong>Rear Rack:</strong> Ibera PakRak - $54.99</li>\n<li><strong>Trunk Bag:</strong> Ibera PakRak - $69.99</li>\n<li><strong>Pannier Bags:</strong> Ortlieb Back Roller Classic - $215.00 (pair)</li>\n<li><strong>Frame Bag:</strong> Blackburn Outpost - $89.99</li>\n<li><strong>Salsa EXP Anything Bag</strong> - $52.00 (each)</li>\n<li><strong>Blackburn Anything Cage</strong> - $35.00 (each)</li>\n<li><strong>Handlebar Bag:</strong> Ortlieb Ultimate Six - $140.00</li>\n<li><strong>Seat:</strong> Selle Royal Float - $45.99</li>\n<li><strong>Seat Bag:</strong> Topeak Aero - $29.99</li>\n<li><strong>Generic Handlebar Cup Holder</strong> - $12.99</li>\n<li><strong>Wild Man Top Tube Bag</strong> - $19.99</li>\n<li><strong>Headlight:</strong> Gearlight S400 - $19.99</li>\n<li><strong>Tail Light:</strong> Cygolite Hotshot - $39.99</li>\n<li><strong>Tire Pump:</strong> Rehook Air (sooooo slow) - $34.99</li>\n<li><strong>Marspeeder Phone Mount</strong> - $21.99</li>\n<li><strong>Bike Multi-Tool:</strong> Vibrelli V19 - $29.99</li>\n<li><strong>Metric Allen Wrench Set</strong> $15.99</li>\n<li><strong>Walmart Tire Repair Kit</strong> $9.99</li>\n<li><strong>Hafney Bar End Mirror</strong> - $24.99</li>\n</ul>\n<p>Let’s talk a little safety. When it comes to lights, there’s three things to think about. Battery, brightness, and ruggedness. For a headlight, get a rechargeable light with a metal housing and it wouldn’t hurt to get multiple. I had two headlights on my setup, one mounted horizontally to the flatbar and another mounted vertically on the drop bar portion that I used for extra coverage or as a flashing light depending on the conditions. For rear lights, I think I had 4 different lights. One main flashing light that was extremely bright. In addition to that I had several, colorful accent lights pointed in different directions to make my bike more visible and easier to identify as a bike.</p>\n<p>In Bozeman, Montana I transformed my bike into the highly visible and highly annoying; Rave Bike. I bought a handful of cheap kayak and decorative LEDs to mount all over my bike and set them all to flash in different colors. Then every time I had to roll through a town or city during the nighttime, I would set my Bluetooth speaker to full volume and blast techno and brostep music through all the quiet neighborhoods I passed through. During my Rave Bike era I also wore a high visibility, reflective vest which I recommend you to have if you aren’t planning on going full rave mode.</p>\n<h2>Camping Gear</h2>\n<ul>\n<li><strong>Tent:</strong> Naturehike CloudUp-1- $159.99</li>\n<li><strong>Sleeping Bag:</strong> Teton Leef 0 Degree- $89.99</li>\n<li><strong>Sleeping Pad:</strong> Big Agnes Air Core Ultra - $79.99</li>\n<li><strong>Sleeping Pad Pump:</strong> Big Agnes Pumphouse Ultra - $34.95</li>\n<li><strong>Pillow:</strong> Nemo Fillo - $39.99</li>\n<li><strong>Woodland Camo Scrim</strong> - $20.00</li>\n<li><strong>Stove:</strong> SOTO Windmaster - $64.95</li>\n<li><strong>Foldable Solar Panel</strong> $40.00</li>\n<li><strong>Bear Spray</strong> - (gifted)</li>\n<li><strong>Cold Steel Tanto Knife</strong> $49.99</li>\n<li><strong>Approx. Total Cost</strong> $579.85</li>\n</ul>\n<p>On the self defense side of safety, I recommend on having <strong>at least</strong> bear spray with you. When I had to wild/stealth camp I would always sleep with my fixed blade knife, flashlight, phone, and bear spray right next to my head. Luckily I never had to use any of my self defense tools on any animals or humans. I did once wake up to the sound of rustling on the side of my tent. I groggily picked my head up slightly to see if I could figure out what curious little critter was looking for food in my camp as I did make myself some beef stew earlier that day.</p>\n<blockquote>\n<p><em>Hmmmpf</em></p>\n</blockquote>\n<p>My fight or flight sense activated without warning. It took my still half asleep brain a second or two to figure out why it was suddenly ready throw hands.</p>\n<blockquote>\n<p><em>Hmmmpf, sniff sniff</em></p>\n</blockquote>\n<blockquote>\n<p>“Oh that’s a bear.” I thought to myself</p>\n</blockquote>\n<p>The heavy breathing and powerful snuffling were unmistakable. In northern Montana, (Around Eureka) that meant one thing: grizzly bear. They can smell food from over 20 miles away. <em>Maybe I shouldn’t have made that beef stew</em>. I figured this was going to happen sooner or later so I weighed my options. I read somewhere that you should made a bunch of noise to startle the bear away. I also happened to read in a separate article that that was a great way to get mauled. Another article advised turning on your flashlight inside your tent to surprise and confuse the bear away. I also had a sneaky suspicion that course of action could cause the bear to become a little TOO curious. Turns out there’s a lot of ways to die to a bear, who would’ve thought. But eventually after careful and nervous consideration, I made up my mind. I looked at my watch and it read about 5am in the morning. I put my earbuds in and fell back asleep about 5 minutes later. I woke up a couple hours later with no sign of the bear anywhere. Now I’m not saying that ignoring the danger is the best course of action but I suppose it’s a lesson that preparedness doesn’t exclusively refer to the tools and gadgets. I had the proper gear but still decided to take a more passive route to decrease the chance of bleeding out in a nylon coffin. This story is also a testament to how comfy my sleep setup was. My Big Agnes sleeping pad is one of those big, inflatable ones. It packs down small, it’s so comfortable, and surprisingly rugged. My sleeping bag was actually sometimes a little too hot and did not pack down as well, it actually ended up taking half of a pannier bag worth of space. My favorite part of my setup though had to be the Nemo Fillo, a half inflatable/half foam pillow. I packs down incredibly well and you can adjust it for your preferred head position. I even used it to sleep on cold, hard concrete in the Hollywood streets. Heck I still use it in my bed now.</p>\n<h2>Additional Equipment</h2>\n<ul>\n<li><strong>Anker 20W USB C Power Strip</strong> - $29.99</li>\n<li><strong>Multi-port USB Charging Brick</strong> - $14.99</li>\n<li><strong>Power Banks:</strong></li>\n<li><strong>2x</strong> 10000mAh - $19.99 each</li>\n<li><strong>1x</strong> 20000mAh - $29.99</li>\n<li><strong>Cameras:</strong></li>\n<li><strong>Nikon D5300</strong> - $699.99</li>\n<li><strong>GoPro Hero 10 Black</strong> - $349.99</li>\n<li><strong>Jabra Elite Active 7 Earbuds</strong> - $179.99</li>\n<li><strong>AirPods Pro</strong> $249.99</li>\n<li><strong>Sony XB-33 Speaker</strong> - $148.00</li>\n<li><strong>Garmin Instinct Watch</strong> - $199.99</li>\n<li><strong>iPhone 13</strong> - $699.99</li>\n<li><strong>Salomon X-Ultra 3 Shoes</strong> - $149.99</li>\n<li><strong>Vans UltraRange EXO</strong> - $89.99</li>\n<li><strong>US Army Dust Goggles</strong> - $29.99</li>\n<li><strong>Rite in the Rain Notepad</strong> - $8.99</li>\n<li><strong>Padded Cycling Shorts (NWT)</strong> - $45.99</li>\n<li><strong>Marmot Rain Jacket</strong> - $99.99</li>\n<li><strong>North Face NanoPuff Coat</strong>$99.99</li>\n<li><strong>4 pairs of socks</strong></li>\n<li><strong>5 pairs of underwear</strong></li>\n<li><strong>2 pairs of shorts</strong></li>\n<li><strong>A pair of joggers</strong></li>\n<li><strong>4 T-Shirts</strong></li>\n<li><strong>Toiletries</strong></li>\n<li><strong>Gorilla Tape</strong></li>\n<li><strong>Approx. Total Cost</strong> $3,167.82</li>\n</ul>\n<h3><strong>Approx. Grand Total: $5,547.52</strong></h3>\n<p>Now onto clothes and gadgets. Having the right clothes is super important for a long bike trip. For me, I started out simple: a couple of yellow t-shirts with the sleeves cut off as my riding shirts and one pair of padded bike shorts. They weren’t the tight, Tour De France kind. More rugged, with a tough exterior that held up the entire trip. They dried out pretty quickly too, which was a bonus.</p>\n<p>Later, I switched out the t-shirts for some breathable tank tops made for more athletic purposes. I got them cheap at Walmart, and honestly, they worked great. You don’t need to drop a ton of money to stay comfortable on a bike. You’re going to be hot and sweaty no matter what, so you might as well wear stuff you don’t mind trashing. I also brought plenty of breathable, stretchy underwear and only packed Merino wool socks. Merino wool is awesome, it keeps your feet warm when it’s cold, wicks away sweat when it’s hot, and adds a nice bit of cushioning, especially if you end up doing some hiking after a long day of riding.</p>\n<p>I had a couple of extra t-shirts for off days and hanging out in town. Weirdly, I only brought one pair of pants, but it worked out fine. For shoes, I relied on my Salomon boots. Fun fact: as I’m writing this segment in December 2024, I’m still wearing the same boots I started my bike trip in. They’ve got thousands (and I for real mean thousands) of miles on them, and somehow, they’re still going strong.</p>\n<p>When it rained, I had a Marmot rain jacket that did the job. If you’re getting a rain jacket, make sure it has pit zips. Sweating inside a raincoat is so much worse than getting a little wet from the rain. I’d rather deal with rain than feel like I’m in a portable salt sauna. I also brought a puff jacket that could pack into itself, which was super convenient. I didn’t use it much since I was biking in the summer, but it was nice to have just in case.</p>\n<p>For gadgets, one of my best finds was this small Anker power strip. It packs down tiny, and I used it to charge everything; lights, portable chargers, my phone, and even a Bluetooth speaker. Speaking of portable chargers, bring more than one. Trust me, having multiple is a lifesaver. I also tried using a portable solar panel strapped to my trunk bag. Honestly, it didn’t work as well as I hoped, even though it was in the sun all day. It was honestly pretty cheap so that’s probably on me.</p>\n<p>When it came to laundry, I carried one of those travel-sized detergent bottles that you can find at Dollar Tree or really any grocery store. My trick? Every time I stayed at a Warm Showers house, I’d refill it. Same deal with shampoo and body wash; I just made a mix of shampoo, conditioner, and body wash in one bottle to save space. Another pro tip: double-check that the caps on your bottles are tight. Once, I hit a big bump, crashed, and later discovered that all my clothes were soaked in detergent. I had to wear the same clothes that I had on for a couple of days until I could wash everything. Lesson learned.</p>\n<p>One random but clutch thing I brought: U.S. Army-issued dust goggles. I packed them for the desert in case of sandstorms (yeah kind of random but who knows), but they ended up being great for mountain passes. When you’re bombing down a hill at 30 to 35 mph, bugs are a real problem. The goggles saved me from getting smacked in the eyes, which, let’s be honest, is kind of important when you’re going that fast with nearly zero protection.</p>\n<p>Oh, and here’s a solid water tip. If you’re using disposable water bottles, suck the air out, crush them down to take up less space. Then, before you hit a stretch where there’s no access to water for a while, just blow them back up and fill them up at a gas station. It’s an easy way to carry extra reserves for those long, dry gaps between towns.</p>\n<p>Okay, I think that’s about all I’ll get into about the gear I used. I want to make this book equally readable for potential, former, and non travelers alike. So I won’t dive into anything too specific but I did my best to highlight gear I enjoyed and valued using. There will be more gear oriented tips and whatnot later on in the coming pages I’m sure. So why don’t we move onto the next section I suppose.</p>\n<p><!-- notionvc: f6d5469a-5cad-45ad-8bd4-f37e7bfcc1b8 --></p>",
            "image": "https://TheCloutySkies.github.io/bloggyskies/media/posts/3/IMG_2066.jpeg",
            "author": {
                "name": "Lonnie Johnston"
            },
            "tags": [
            ],
            "date_published": "2026-01-20T23:02:46-08:00",
            "date_modified": "2026-01-20T23:31:34-08:00"
        },
        {
            "id": "https://TheCloutySkies.github.io/bloggyskies/a-second-home.html",
            "url": "https://TheCloutySkies.github.io/bloggyskies/a-second-home.html",
            "title": "A Second Home",
            "summary": "2020. I was a sophomore in high school when the pandemic hit us. My friends and I initially were so excited to be out of school early. The first two weeks or so were awesome; video games, Discord calls, and making plans for YouTube videos&hellip;",
            "content_html": "<figure class=\"post__image post__image--full\"><img loading=\"lazy\"  src=\"https://TheCloutySkies.github.io/bloggyskies/media/posts/2/20220915_200018_44DF1F.jpeg\" alt=\"The Outpost, 2023. The Glory Days\" width=\"2048\" height=\"1366\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://TheCloutySkies.github.io/bloggyskies/media/posts/2/responsive/20220915_200018_44DF1F-xs.jpeg 640w ,https://TheCloutySkies.github.io/bloggyskies/media/posts/2/responsive/20220915_200018_44DF1F-sm.jpeg 768w ,https://TheCloutySkies.github.io/bloggyskies/media/posts/2/responsive/20220915_200018_44DF1F-md.jpeg 1024w ,https://TheCloutySkies.github.io/bloggyskies/media/posts/2/responsive/20220915_200018_44DF1F-lg.jpeg 1366w ,https://TheCloutySkies.github.io/bloggyskies/media/posts/2/responsive/20220915_200018_44DF1F-xl.jpeg 1600w ,https://TheCloutySkies.github.io/bloggyskies/media/posts/2/responsive/20220915_200018_44DF1F-2xl.jpeg 1920w\"></figure>\n<p> </p>\n<p>2020. I was a sophomore in high school when the pandemic hit us. My friends and I initially were so excited to be out of school early. The first two weeks or so were awesome; video games, Discord calls, and making plans for YouTube videos and overly ambitious films. It all served as a distraction from the real world consequences of the pandemic. We spent the summer of 2020 hanging out, trying to execute our video plans, and other teenager tomfoolery. When weeks became months and the pandemic restrictions still didn’t seem to be lifting, the more it felt to us that maybe the world really was ending. So naturally as dramatic teenagers we decided the best course of action was venturing into the woods, which we started doing in early 2021 after school.<!-- notionvc: b2f68e96-d515-441f-b593-0d96d84fa5d7 --></p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\" data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"2\">\n<figure class=\"gallery__item\"><a href=\"https://TheCloutySkies.github.io/bloggyskies/media/posts/2/gallery/IMG_0793.jpeg\" data-size=\"6000x4000\"><img loading=\"lazy\" src=\"https://TheCloutySkies.github.io/bloggyskies/media/posts/2/gallery/IMG_0793-thumbnail.jpeg\" alt=\"\" width=\"720\" height=\"480\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://TheCloutySkies.github.io/bloggyskies/media/posts/2/gallery/IMG_0795.jpeg\" data-size=\"6000x4000\"><img loading=\"lazy\" src=\"https://TheCloutySkies.github.io/bloggyskies/media/posts/2/gallery/IMG_0795-thumbnail.jpeg\" alt=\"\" width=\"720\" height=\"480\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://TheCloutySkies.github.io/bloggyskies/media/posts/2/gallery/IMG_0796.jpeg\" data-size=\"6000x4000\"><img loading=\"lazy\" src=\"https://TheCloutySkies.github.io/bloggyskies/media/posts/2/gallery/IMG_0796-thumbnail.jpeg\" alt=\"\" width=\"720\" height=\"480\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://TheCloutySkies.github.io/bloggyskies/media/posts/2/gallery/IMG_0797.jpeg\" data-size=\"6000x4000\"><img loading=\"lazy\" src=\"https://TheCloutySkies.github.io/bloggyskies/media/posts/2/gallery/IMG_0797-thumbnail.jpeg\" alt=\"\" width=\"720\" height=\"480\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://TheCloutySkies.github.io/bloggyskies/media/posts/2/gallery/IMG_0798.jpeg\" data-size=\"6000x4000\"><img loading=\"lazy\" src=\"https://TheCloutySkies.github.io/bloggyskies/media/posts/2/gallery/IMG_0798-thumbnail.jpeg\" alt=\"\" width=\"720\" height=\"480\"></a></figure>\n</div></div>\n<p>The above photos were taken on July 31, 2021, this version of the Outpost took about 5-6 months of intermittent construction using pallets, cinder blocks, tarps, sheet metal, vinyl siding and anything else we could get our hands on.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\" data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"2\">\n<figure class=\"gallery__item\"><a href=\"https://TheCloutySkies.github.io/bloggyskies/media/posts/2/gallery/20230429_212728_4792D8.jpeg\" data-size=\"1512x2016\"><img loading=\"lazy\" src=\"https://TheCloutySkies.github.io/bloggyskies/media/posts/2/gallery/20230429_212728_4792D8-thumbnail.jpeg\" alt=\"\" width=\"720\" height=\"960\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://TheCloutySkies.github.io/bloggyskies/media/posts/2/gallery/F5F2A84A-45D9-4D23-9066-0A6BC4B4D922.jpeg\" data-size=\"744x992\"><img loading=\"lazy\" src=\"https://TheCloutySkies.github.io/bloggyskies/media/posts/2/gallery/F5F2A84A-45D9-4D23-9066-0A6BC4B4D922-thumbnail.jpeg\" alt=\"\" width=\"720\" height=\"960\"></a></figure>\n</div></div>\n<p><!-- notionvc: 64da3af4-c9ac-40ec-a0dc-9267da079cae --></p>\n<p>The Outpost could fit about 8 people with gear. In the beginnings we didn’t have a lot inside just some food, water, fire making supplies, and extra bedding for overnight stays. A buddy of ours had some extra flooring from a recent home renovation which we used by nailing into our uneven pallet floor. Another essential purchase we made was a propane space heater, we were able to sleep surprisingly comfortably during below freezing temperatures in the winter. Eventually we added a fireplace (which only blew smoke into the room with no heat), a porch, small outdoor gym, a fence, parking spots, a running sink, and cardboard insulation. <!-- notionvc: ac55aaac-3fee-4de6-b002-4b985b14622a --></p>\n<p>Our parents had various names for the place, Hobo Hut, The Shelter, The Cabin in the Woods, a campsite. To us though, this was a home away from home. Something that felt truly ours in a world that felt so eager to control us in these pivotal years of our emerging lives. Some of my best memories with my best friends happened in that couple of wooded acres.</p>\n<p>I don't want to fill this post with many regrets but I do wish we make more of an effort to write in our Outpost journal. Intermittently we would remember that it existed and we would assign someone to make a short entry. Subjects would range from improvements, skinwalker encounters, to reminiscing on the good ole days. Luckily I was able to get my homie to send pictures of all the pages and I transcribed them here for anyone to read. The inner cover contained a small database of everyone's birthday and this quote which truly summed out how we felt about the place, </p>\n<blockquote>\n<p class=\"p1\">“A beacon of hope and imagination. A creative outlet for all of us. A place to feel safe and a place where we all belong.”</p>\n</blockquote>\n<p>From there we have various entries spanning several years.</p>\n<hr>\n<h5 class=\"p1\">4-27-2022</h5>\n<blockquote>\n<p class=\"p1\">Sitting at this table, makes me reminisce about the old days. When everyone was accountable, and I never felt alone. This place was a safe-haven in the summer. But those days are gone in this place feels like a graveyard of drifting memories.</p>\n</blockquote>\n<h5 class=\"p1\">5-12-2022</h5>\n<blockquote>\n<p class=\"p1\">Today is the hottest day of the year so far. Progress needs to be made for the expansion of the outpost. I long for the days of old when progress was always happening. Memento Mori.</p>\n</blockquote>\n<h5 class=\"p1\">5-25-2022</h5>\n<blockquote>\n<p class=\"p1\">A decently productive day we officially started sparring for our tournament on May 9th/13th, 2023. The skin walkers are getting worse. We attempted to make contact today, it was a partial success. We will need to experiment more. Combat skills need to be improved before we make initial contact.</p>\n</blockquote>\n<h5 class=\"p1\">6-1-2022</h5>\n<blockquote>\n<p class=\"p1\">War has been waged some goofy goobers have decided to vandalize home. The “moon‘s out goons out” phase has been initiated for the outpost. Offensive and defensive measures have been taken.</p>\n</blockquote>\n<h5 class=\"p1\">8-2-2022</h5>\n<blockquote>\n<p class=\"p1\">Happy birthday, Griffin!</p>\n</blockquote>\n<h5 class=\"p1\">9-1-2022</h5>\n<blockquote>\n<p class=\"p1\">The friend group is separating, the intervals between visits are lengthening. The outpost survived a storm with 80 mile an hour plus winds. Brent‘s hair looks fire. We need to come out here more often to keep home healthy.</p>\n</blockquote>\n<h5 class=\"p1\">10-14-2022</h5>\n<blockquote>\n<p class=\"p1\">Today was productive. The whole is about halfway done. We trekked up to the ridge at night. Noises all around the leaves are falling. The night was cold, but we survived.</p>\n</blockquote>\n<h5 class=\"p1\">10-20-2022</h5>\n<blockquote>\n<p class=\"p1\">First day back of the outpost in about three months, I’ve missed this place so much and now I am back! I feel at home. The sounds of the leaves and the birds chirping in the distance or sounds that I’ve been lying to hear. It’s great to be back.</p>\n</blockquote>\n<h5 class=\"p1\">3-17-2024</h5>\n<blockquote>\n<p class=\"p1\">Life moves fast, no matter how long we are gone, this place still feels like home. To be honest, not a lot of progress has been made in the last year. The outpost has been serving more as a safe place to isolate from the world. <strong>You don’t have to think about tomorrow here. </strong></p>\n</blockquote>\n<h3 class=\"p1\">5-9-2025</h3>\n<blockquote>\n<p class=\"p1\">I am the only one here, the outpost is in ruins. Several walls have been breached from what seems to be raccoons. I am writing in pencil because the pen has been chewed through. I don’t think I can possibly clean and fix all of this, but I can try. Everything is strung out chewed through ruined or pooped on. All good things come to an end. All things come to an end even dreams. I’m going to miss this place.</p>\n</blockquote>\n<p> </p>\n<p><!-- notionvc: e47b3554-8753-4c7d-bf6f-81e93bfefab3 --></p>\n<p>From what I heard from my friends now is that the Outpost is in a sad state of disarray. There’s holes in the tarps and animals have found there way in and I know that eventually the nature around will reclaim the land we once borrowed for those few wonderful summers.</p>\n<p><!-- notionvc: 46e1b98e-bd80-47a9-bb1d-818591e2f19a --></p>",
            "image": "https://TheCloutySkies.github.io/bloggyskies/media/posts/2/IMG_0793.jpeg",
            "author": {
                "name": "Lonnie Johnston"
            },
            "tags": [
            ],
            "date_published": "2026-01-17T23:45:49-08:00",
            "date_modified": "2026-01-20T23:32:11-08:00"
        }
    ]
}
